const appData = {
  tori: {
    title: 'Tori',
    href: 'https://app.tori.nz/',
    info: {
      header: 'ERP-система',
      tex: 'VueJs, Element-UI, Canvas, SCSS, ChartJs',
      features: [
        'Вся клиентская часть реализована мной',
        'Код предоставляет возможность динамического построения страниц. Управляется с сервера',
        'Реализован календарь-sheduler',
        'Реализован drag&drop таблиц',
        'Реализовано сохранение в localStorage фильтров и порядок колонок в таблицах, установленных пользователем',
        'Реализован export таблиц в  .pdf и .csv форматы',
        'Работа с файлами, который загружает пользователь: cropper, валидация, отправка и т.д.',
        'Подключены Google Maps',
        'и др. вещи, которые уже и не кажутся какими-то особенными',
      ]
    }
  },
  dobuy: {
    title: 'DoBuy',
    href: 'http://dobuy.com.ua',
    info: {
      header: 'Интернет-магазин ',
      tex: 'JS, HTML, CSS, NodeJs, MongoDB',
      features: [
        'Личный проект. Полностью реализован мной',
        'Разработана система проведения он-лайн замеров вещей',
        'Админ-панель – позволяет работать с заказами, товарами (добавлять/изменять/удалять)',
        'Интегрировано API Новой Почты',
        'Реализована фильтрация, сортировка, товаров; пагинация',
        'При написании магазина, кроме html2canvas, не использовано ни одного стороннего плагина'
      ]
    }
  },
  lords: {
    title: 'Lords',
    href: 'http://lords.dobuy.com.ua',
    info: {
      header: 'Браузерная MMO RST',
      tex: 'VueJs, NodeJs, MongoDB, WebSoket, SASS, Canvas ',
      features: [
        'Личный проект. Полностью реализован мной',
        'авторизация, сессии',
        'карта мира отображается в виде изометрической проекции',
        'карта мира реализована в виде глобуса. Передвижение по ней зациклено',
        'система улучшения добывающих шахт, с внесением соответствующих изменений в БД',
        'прирост ресурсов, юнитов -  с систематическим обновлением, как на стороне клиента, так и в БД',
        'чат',
        'находится в разработке'
      ]
    }
  },
  jcash: {
    title: 'JCash',
    href: 'http://jcash.co/ru/',
    info: {
      header: 'Посадочная страница ',
      tex: 'HTML, CSS',
      features: ['разрабатывал анимацию']
    }
  },
  anycash: {
    title: 'AnyCash',
    href: 'https://any.cash/ru/',
    info: {
      header: 'Онлайн обменник ',
      tex: 'NuxtJs',
      features: [
        'в большей степени занимался рефакторингом компонентов',
        'подключал авторизацию через сторонние сервисы: Google, FB, Telegram ',
        'создавал popup-компоненты'
      ]
    }
  },
  pwa: {
    title: 'PWA',
    href: 'https://test.dobuy.com.ua',
    info: {
      header: 'Тестовое PWA - змейка ',
      tex: 'Canvas, ServiceWorker, Notification API, HTTPS',
      features: [
        'Добавляется на любой девайс, на котором реализована поддержка технологии PWA',
        'Мой ребенок играется)'
      ]
    }
  },
  betParser: {
    title: 'BetParser',
    href: '',
    info: {
      header: 'Парсер букмекерскир контор ',
      tex: 'Puppeteer, NodeJs, Vue3, Element-UI, MongoDB, WebSocket',
      features: [
        'Парсер букмекерских контор, на предмет поиска вилок',
        'Пока только личное использование'
      ]
    }
  }
};
